[
    {
        "What recent or past achievement made you feel competent and energized?": "Built a full-stack website 'Kube Education' to connect teachers with students and ran Facebook ad campaigns; achieved medium-to-good traction.",
        "user_id": "Career_coach",
        "page_id": "612142091972168",
        "Educational background": "BBA, 4th year (details pending: college, city, expected graduation, specialization)",
        "Work experience": "Accountant at Nabil Bank for 1 month (details pending: employment type, key tasks)",
        "Why are you considering career planning now": "Since childhood loves creating; chose management path so couldn’t pursue science; wants to align career with building/coding.",
        "What was the biggest challenge in this story?": "Fear of talking to new people.",
        "How did you overcome it?": "Talked with 30+ people per day to run the project; shifted from overthinking to taking immediate action ('just hit call').",
        "What considerations guided your decisions? What was your approach?": "Primary driver was need to make money quickly; adopted action-first approach, focusing on execution over preparation.",
        "How did your approach differ from others? What deeper impact did it have?": "Delivered a clean, advanced website with strong product polish.",
        "Can you share another story from a different context where you helped someone achieve success?": "Helped myself through self-discovery and gained deeper self-understanding; realized previously used emotion rather than logic for thinking; now practices clear thinking.",
        "What common strengths or skills appear across your stories?": "Initiative, technical skill, ability to push through discomfort, self-awareness, reflective thinking, growth mindset, and not being held back by others' opinions.",
        "Do these strengths align with how you see yourself?": "Yes",
        "Which tasks or activities energize you? Which drain you? Give examples.": "Coding energizes me; fixing bugs drains me.",
        "How do you learn and master new skills best?": "Dive in directly without basics; try things; frustrating at first but you learn.",
        "What drives you most – helping others, achieving difficult things, or receiving recognition?": "Receiving recognition.",
        "Which form of recognition matters most – personal gratitude, professional reputation, or both?": "Personal gratitude.",
        "Thinking back to childhood or youth, which games, role-play, or imagined roles revealed your early strengths?": "Building things.",
        "What traits did others often seek your help for? How did they describe you?": "Brave and problem solver.",
        "Imagine your ideal future workday and environment. What would it look like?": "..."
    }
]