[
    {
        "Eucational backgrouns": "MBA, Duke University; Bachelor of Economics, Nankai University; Behavioral Interview certificate; Coaching Certificate, Satir Institute.",
        "work_experience": "11 years senior management experience in Career Service at business school, HR recruiting, Strategy, Sales/Marketing. 20 years’ career coaching for students, professionals. International leadership roles in China, US, Canada. Various director/manager roles in top firms. Built and turned around teams, developed talent, managed budgets and strategy. Coached 5000+ international students.",
        "Why are you considering career planning now": "Currently experiencing a career bottleneck and want to see if there are better options or new directions.",
        "What do you hope to gain from exploring your career strengths?": "...",
        "Can you share a story of an achievement (work, school, or life)?": "Promoted to Sales Director for Shanghai branch due to strong sales. Inherited underperforming team, low morale. Implemented reforms, raised morale, led team to achieve targets. Felt happy and empowered by the process.",
        "What was the biggest challenge in this story?": "Team lacked strategy, capabilities, and confidence. Company brand was weak, sales were hard, and most gave up on targets, feeling they could not be fired.",
        "How did you overcome it?": "Summarized sales best practices from personal experience; provided training so team could master these; boosted self-drive by connecting effort to higher commissions.",
        "What key actions led to the outcome?": "Set clear policies and structure, monitored progress and results, created a supportive environment focused on empowerment rather than micromanagement. Team became proactive and passionate.",
        "How did you approach this differently than others?": "...",
        "Can you share another story from a different context (personal life, relationships, etc.)?": "Coached a recent graduate from ShanghaiTech University through a major/career pivot. Discovered his true interests/motivations, repositioned him for data analytics, helped match experience/resume, taught networking and interview skills, built confidence, and supported him to secure a full-time job after graduation.",
        "What common strengths or skills appear across your stories?": "...",
        "Do these strengths align with how you see yourself?": "...",
        "user_id": "Career_coach",
        "page_id": "612142091972168",
        "Educational background": "MBA, Duke University, Fuqua School of Business, 2003; Bachelor of Economics, Nankai University, International Business, 1995; Behavioral Interview, Randstad, 2007; Coaching Certificate, Satir Institute, 2010",
        "Work experience": "11 years senior management in administrative, budget, and personnel roles; 20 years in career coaching (students and young professionals, all functions/industries); coached 5000+ international students; multi-cultural work/living in China, US, Canada. Work roles include: Career Coach at BLC Consulting (2013-present), Career Counsellor at VPI Inc (2015-2016), Executive Director at Tsinghua University Career Center (2010-2013), Founding Partner of Galaxy Recruitment (2008-2010), Regional Director at Randstad (2006-2008), Marketing Director at Zhaopin.com (2004-2006), Sales & Marketing Manager at Zhaopin.com (2000-2001), Global Key Account Manager at Manpower (2003-2004), Account Executive at Ogilvy & Mather (1999-2000).",
        "What career confusion or goals do you most want to explore": "...",
        "Can you share a story of an achievement or key success at work": "Promoted to Sales Director to manage the Shanghai branch due to strong sales; implemented reforms, raised morale, and led team to achieve both individual and overall targets, resulting in happiness and a sense of potential.",
        "What was the specific situation and the biggest challenge in this story": "Colleagues didn’t know how to develop new clients; company brand wasn’t strong; sales were difficult; most people gave up due to repeated failure and weak accountability. Biggest challenge: lack of good strategy, low capability, and low confidence. Responded by setting clear strategy, provided training, redistributed resources so everyone could develop potential clients.",
        "What were your thought process and considerations in handling it": "Recognized that sales methods drive results, so applied my own successful strategies, organized them into practical steps, provided hands-on training, and focused on boosting the team’s confidence and motivation by helping them experience early success. My goal was to nurture self-driven individuals.",
        "What key actions led to the outcome": "Created and applied clear policy, monitored progress, reviewed results, stopped micro-management; empowered team to take responsibility for their own development, resulting in stronger capability and positivity.",
        "How did you approach this differently than others / what was your unique method": "Focused on root-cause diagnosis, structured strategies, confidence-building, and hands-on empowerment to drive lasting change. Emphasized both individual growth and system-level solutions.",
        "Can you share another story from a different context (e.g., coaching a student)": "Coached a graduate from ShanghaiTech University who lacked direction and confidence in his chosen major. Through deep exploration of his true inclinations, repositioned him for data analytics, helped clarify goals and develop necessary materials, provided confidence-building and interview guidance, and coached networking skills. Result: secured a full-time job in his area of interest after graduation.",
        "What common strengths or patterns appear across your stories": "Ability to diagnose issues at their core, craft tailored strategies, build confidence, and mobilize others’ intrinsic motivation—combining analytical and people-focused approaches for individual and systemic outcomes.",
        "Do these strengths and patterns align with your self-perception": "Yes; confirmed by user.",
        "Which tasks or activities make you feel energized, and which are draining": "Energized by solving complex, novel problems with visible results. Drained by routine, trivial, detail-heavy tasks with little creativity.",
        "How do you prefer to learn and acquire new skills": "Quickly grasp main concepts and underlying methods, minimize repetitive practice, learn by doing, and seek practical input from others to improve.",
        "What motivates you most and gives you a sense of meaning": "Making others better and receiving recognition from others. Also, accomplishing things others cannot do.",
        "Which forms of recognition or achievement matter most to you": "Recognition from others, public praise, seeing direct positive outcomes for others, and achieving hard or unique successes.",
        "What childhood interests or early role-play experiences connect to your strengths": "Ticket seller, selling things, imagined being a female spy and a diplomat—roles involving communication, persuasion, strategy, and problem solving.",
        "How do others perceive your key strengths and traits": "Brainstorming ideas, making decisions, initiating action—seen as strategic, decisive, creative, and proactive.",
        "What would your ideal future daily work and environment look like": "..."
    }
]